glaya1991/stm32f765_test/TK-NFP-TOP/c_stm32f765zit6/sources/Drivers/ILI9341/Inc/ILI9341_config.h
#ifndef TEST1_CONFIG_H
#define TEST1_CONFIG_H

#include <stdint.h>
#include "stm32f7xx_hal.h"
#include "../../../Inc/main.h"
#include "../Drivers/STM32F7xx_HAL_Driver/Inc/stm32f7xx_hal_gpio.h"

// <editor-fold desc="Defaults">
// see main.h
#define TFT_LED_PIN     GPIO_PIN_0
#define TFT_RESET_PIN   SPI1_TFT_RST_Pin  //PD3
#define TFT_DC_PIN      SPI1_TFT_DC_Pin  //PD2
#define TFT_CS_PIN      SPI1_NSS_Pin  //PG10

#define SPI_MASTER                   SPI1
#define SPI_MASTER_CLK               RCC_APB2Periph_SPI
#define SPI_MASTER_GPIO              GPIOA
#define SPI_MASTER_GPIO_CLK          RCC_APB2Periph_GPIOA
#define SPI_MASTER_PIN_NSS           GPIO_PIN_4
#define SPI_MASTER_PIN_SCK           GPIO_PIN_5
#define SPI_MASTER_PIN_MISO          GPIO_PIN_6
#define SPI_MASTER_PIN_MOSI          GPIO_PIN_7

// </editor-fold>

// <editor-fold desc="Colors">


#define BLACK           0x0000      //   0,   0,   0
#define NAVY            0x000F      //   0,   0, 128
#define DGREEN          0x03E0      //   0, 128,   0
#define DCYAN           0x03EF      //   0, 128, 128
#define MAROON          0x7800      // 128,   0,   0
#define PURPLE          0x780F      // 128,   0, 128
#define OLIVE           0x7BE0      // 128, 128,   0
#define LGRAY           0xC618      // 192, 192, 192
#define DGRAY           0x7BEF      // 128, 128, 128
#define BLUE            0x001F      //   0,   0, 255
#define GREEN           0x07E0      //   0, 255,   0
#define CYAN            0x07FF      //   0, 255, 255
#define RED             0xF800      // 255,   0,   0
#define MAGENTA         0xF81F      // 255,   0, 255
#define YELLOW          0xFFE0      // 255, 255,   0
#define WHITE           0xFFFF      // 255, 255, 255
#define ORANGE          0xFD20      // 255, 165,   0
#define GREENYELLOW     0xAFE5      // 173, 255,  47
#define BROWN                 0XBC40 //
#define BRRED                 0XFC07 //


// </editor-fold>

#endif //TEST1_CONFIG_H
